[
  {
    "id": "CARD-001",
    "category": "Cardiac",
    "stem": "A 64-year-old with HFrEF is started on a medication that reduces mortality by blocking beta-1 receptors. Which drug is most appropriate?",
    "choices": ["Amlodipine", "Carvedilol", "Hydralazine", "Verapamil"],
    "answerIndex": 1,
    "explanation": "Carvedilol (and other evidence-based beta blockers) improves survival in HFrEF. The other options do not provide the same mortality benefit in this context.",
    "reference": "Add your reference here (optional)"
  },
  {
    "id": "ABX-001",
    "category": "Antibiotics",
    "stem": "A patient develops tendon pain after starting an antibiotic for pyelonephritis. Which class is most associated with this adverse effect?",
    "choices": ["Macrolides", "Fluoroquinolones", "Tetracyclines", "Sulfonamides"],
    "answerIndex": 1,
    "explanation": "Fluoroquinolones are associated with tendinopathy and tendon rupture risk.",
    "reference": "Optional"
  }
,
  {
    "id": "DCB1-0001",
    "category": "Cardiac",
    "difficulty": "Easy",
    "stem": "A 52-year-old develops a persistent dry cough a few weeks after starting lisinopril for hypertension. Which medication would provide similar blood pressure benefit with a much lower risk of cough?",
    "choices": ["Losartan", "Hydrochlorothiazide", "Amlodipine", "Propranolol"],
    "answerIndex": 0,
    "explanation": "ACE inhibitors can cause cough due to increased bradykinin. ARBs (e.g., losartan) provide similar RAAS blockade with a much lower incidence of cough.",
    "reference": ""
  },
  {
    "id": "DCB1-0002",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient takes sildenafil for erectile dysfunction and is prescribed a medication for angina. Which combination is most likely to cause dangerous hypotension?",
    "choices": ["Nitroglycerin and sildenafil", "Metoprolol and sildenafil", "Atorvastatin and sildenafil", "Aspirin and sildenafil"],
    "answerIndex": 0,
    "explanation": "Nitrates increase nitric oxide/cGMP and PDE-5 inhibitors prevent cGMP breakdown. Together they can cause profound vasodilation and severe hypotension.",
    "reference": ""
  },
  {
    "id": "DCB1-0003",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient on an antiarrhythmic develops progressive dyspnea, pulmonary fibrosis on imaging, and blue-gray skin discoloration. Which drug is the most likely cause?",
    "choices": ["Amiodarone", "Lidocaine", "Flecainide", "Adenosine"],
    "answerIndex": 0,
    "explanation": "Amiodarone can cause pulmonary toxicity (including fibrosis), thyroid dysfunction, corneal deposits, photosensitivity/blue-gray skin changes, and hepatotoxicity.",
    "reference": ""
  },
  {
    "id": "DCB1-0004",
    "category": "Cardiac",
    "difficulty": "Hard",
    "stem": "A patient with known Wolff-Parkinson-White (WPW) presents with an irregular wide-complex tachycardia consistent with atrial fibrillation with pre-excitation. The patient is hemodynamically stable. Which medication is appropriate for acute pharmacologic management?",
    "choices": ["Procainamide", "Verapamil", "Digoxin", "Adenosine"],
    "answerIndex": 0,
    "explanation": "In AF with WPW, avoid AV nodal blockers (adenosine, beta blockers, verapamil/diltiazem, digoxin) because they can increase conduction through the accessory pathway and precipitate VF. Procainamide is an appropriate option in stable patients.",
    "reference": ""
  },
  {
    "id": "DCB1-0005",
    "category": "Cardiac",
    "difficulty": "Easy",
    "stem": "A pregnant patient is found to have chronic hypertension. Which medication should be avoided because it can cause fetal renal abnormalities and oligohydramnios?",
    "choices": ["Lisinopril", "Labetalol", "Methyldopa", "Nifedipine"],
    "answerIndex": 0,
    "explanation": "ACE inhibitors (and ARBs) are contraindicated in pregnancy due to fetal toxicity, including impaired renal development and oligohydramnios.",
    "reference": ""
  },
  {
    "id": "DCB1-0006",
    "category": "Lipids",
    "difficulty": "Easy",
    "stem": "Which mechanism best describes how statins lower LDL cholesterol?",
    "choices": ["Inhibit HMG-CoA reductase leading to increased LDL receptor expression", "Block intestinal cholesterol absorption at the brush border", "Bind circulating PCSK9 to prevent LDL receptor degradation", "Activate PPAR-alpha to reduce triglycerides"],
    "answerIndex": 0,
    "explanation": "Statins inhibit HMG-CoA reductase, decreasing hepatic cholesterol synthesis and upregulating LDL receptors, which increases LDL clearance from the blood.",
    "reference": ""
  },
  {
    "id": "DCB1-0007",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient with hypertension starts a new medication and later develops a gout flare. Which antihypertensive is most associated with hyperuricemia and gout?",
    "choices": ["Hydrochlorothiazide", "Losartan", "Amlodipine", "Lisinopril"],
    "answerIndex": 0,
    "explanation": "Thiazide diuretics can increase uric acid levels and precipitate gout flares. (Losartan is notable for tending to lower uric acid.)",
    "reference": ""
  },
  {
    "id": "DCB1-0008",
    "category": "Cardiac",
    "difficulty": "Hard",
    "stem": "A patient taking digoxin presents with nausea, confusion, and yellow-green visual halos. ECG shows ventricular ectopy. Which treatment is most appropriate for life-threatening digoxin toxicity?",
    "choices": ["Digoxin immune Fab", "N-acetylcysteine", "Protamine sulfate", "Flumazenil"],
    "answerIndex": 0,
    "explanation": "Digoxin immune Fab (digoxin-specific antibody fragments) is used for severe digoxin toxicity (e.g., life-threatening arrhythmias, significant symptoms, or marked hyperkalemia).",
    "reference": ""
  },
  {
    "id": "DCB1-0009",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient develops watery diarrhea and abdominal pain after taking an antibiotic. Colonoscopy shows pseudomembranes. Which antibiotic is classically associated with this complication?",
    "choices": ["Clindamycin", "Azithromycin", "Cefazolin", "Doxycycline"],
    "answerIndex": 0,
    "explanation": "Clindamycin is a classic trigger for C. difficile–associated pseudomembranous colitis (though many antibiotics can contribute).",
    "reference": ""
  },
  {
    "id": "DCB1-0010",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "Which antibiotic is typically ineffective against anaerobes because its uptake into bacteria requires oxygen-dependent transport?",
    "choices": ["Gentamicin", "Metronidazole", "Clindamycin", "Piperacillin-tazobactam"],
    "answerIndex": 0,
    "explanation": "Aminoglycosides (e.g., gentamicin) require oxygen-dependent transport into bacteria, so they have poor activity against anaerobes.",
    "reference": ""
  },
  {
    "id": "DCB1-0011",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient taking metronidazole is counseled to avoid alcohol. What is the main reason for this counseling?",
    "choices": ["Disulfiram-like reaction (flushing, nausea, vomiting)", "Severe QT prolongation and torsades de pointes", "Hypertensive crisis due to tyramine interaction", "Life-threatening hyperkalemia"],
    "answerIndex": 0,
    "explanation": "Metronidazole can cause a disulfiram-like reaction with alcohol, leading to flushing, nausea, vomiting, and headache.",
    "reference": ""
  },
  {
    "id": "DCB1-0012",
    "category": "Antibiotics",
    "difficulty": "Hard",
    "stem": "A patient on sertraline develops agitation, diaphoresis, tremor, hyperreflexia, and diarrhea shortly after starting an antibiotic for pneumonia. Which antibiotic is most likely responsible due to MAO-inhibiting properties?",
    "choices": ["Linezolid", "Ceftriaxone", "Azithromycin", "Doxycycline"],
    "answerIndex": 0,
    "explanation": "Linezolid has MAOI activity and can precipitate serotonin syndrome when combined with serotonergic agents (e.g., SSRIs).",
    "reference": ""
  },
  {
    "id": "DCB1-0013",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient receiving vancomycin develops flushing and pruritus during the infusion. What is the best next step?",
    "choices": ["Slow the infusion rate and consider an antihistamine", "Stop permanently due to IgE-mediated allergy", "Add probenecid to prevent the reaction", "Switch immediately to an aminoglycoside"],
    "answerIndex": 0,
    "explanation": "Red man syndrome is an infusion-related histamine release reaction. Management is slowing the infusion and using antihistamines; it is not typically an IgE allergy.",
    "reference": ""
  },
  {
    "id": "DCB1-0014",
    "category": "Antibiotics",
    "difficulty": "Hard",
    "stem": "A patient with MRSA bacteremia is switched to a different antibiotic but fails to improve when pneumonia is also present. Which MRSA-active antibiotic is inactivated by pulmonary surfactant and is therefore not used for pneumonia?",
    "choices": ["Daptomycin", "Vancomycin", "Linezolid", "Ceftaroline"],
    "answerIndex": 0,
    "explanation": "Daptomycin is inactivated by pulmonary surfactant, so it is not effective for pneumonia. It can also cause myopathy (monitor CPK).",
    "reference": ""
  },
  {
    "id": "DCB1-0015",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient stabilized on warfarin starts an antibiotic and returns with a markedly increased INR. Which antibiotic is well known for potentiating warfarin and increasing bleeding risk?",
    "choices": ["Trimethoprim-sulfamethoxazole", "Amoxicillin", "Nitrofurantoin", "Daptomycin"],
    "answerIndex": 0,
    "explanation": "Trimethoprim-sulfamethoxazole can significantly increase INR in patients on warfarin (via metabolic interactions and effects on vitamin K–producing gut flora).",
    "reference": ""
  },
  {
    "id": "DCB1-0016",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "Which mechanism best describes how beta-lactam antibiotics kill susceptible bacteria?",
    "choices": ["Inhibit transpeptidase-mediated cross-linking of peptidoglycan", "Bind the 30S ribosomal subunit to block tRNA entry", "Inhibit DNA gyrase and topoisomerase IV", "Inhibit dihydrofolate reductase"],
    "answerIndex": 0,
    "explanation": "Beta-lactams inhibit cell wall synthesis by binding penicillin-binding proteins (transpeptidases), preventing cross-linking of peptidoglycan and leading to cell lysis.",
    "reference": ""
  },
  {
    "id": "DCB1-0017",
    "category": "Antifungals",
    "difficulty": "Easy",
    "stem": "A patient treated with amphotericin B develops rising creatinine and low potassium and magnesium. What is the primary mechanism of amphotericin B?",
    "choices": ["Binds ergosterol and forms membrane pores", "Inhibits 14-alpha-demethylase to block ergosterol synthesis", "Inhibits beta-1,3-D-glucan synthesis in the fungal cell wall", "Inhibits squalene epoxidase"],
    "answerIndex": 0,
    "explanation": "Amphotericin B binds ergosterol in fungal membranes and forms pores, leading to cell death. Nephrotoxicity and electrolyte wasting (low K/Mg) are key adverse effects.",
    "reference": ""
  },
  {
    "id": "DCB1-0018",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient taking fluconazole develops elevated liver enzymes, and medication levels of a different drug rise due to CYP inhibition. What is the mechanism of azole antifungals?",
    "choices": ["Inhibit 14-alpha-demethylase to block ergosterol synthesis", "Bind ergosterol and form pores", "Inhibit beta-1,3-D-glucan synthesis", "Bind microtubules to inhibit mitosis"],
    "answerIndex": 0,
    "explanation": "Azoles inhibit fungal 14-alpha-demethylase, decreasing ergosterol synthesis. Many azoles inhibit CYP enzymes, increasing levels of other medications, and can cause hepatotoxicity.",
    "reference": ""
  },
  {
    "id": "DCB1-0019",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient with invasive candidiasis is treated with caspofungin. Which target does this medication inhibit?",
    "choices": ["Beta-1,3-D-glucan synthesis in the fungal cell wall", "Ergosterol binding to form pores", "DNA-dependent RNA polymerase", "Squalene epoxidase in ergosterol synthesis"],
    "answerIndex": 0,
    "explanation": "Echinocandins (e.g., caspofungin) inhibit beta-1,3-D-glucan synthesis, weakening the fungal cell wall. They are useful for Candida and Aspergillus.",
    "reference": ""
  },
  {
    "id": "DCB1-0020",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient with onychomycosis is treated with a medication that inhibits squalene epoxidase. Which drug fits this mechanism?",
    "choices": ["Terbinafine", "Fluconazole", "Amphotericin B", "Caspofungin"],
    "answerIndex": 0,
    "explanation": "Terbinafine inhibits squalene epoxidase, decreasing ergosterol and causing toxic squalene accumulation. It is commonly used for dermatophyte infections such as onychomycosis.",
    "reference": ""
  },
  {
    "id": "DCB1-0021",
    "category": "Antivirals",
    "difficulty": "Medium",
    "stem": "A patient treated for HSV develops flank pain and rising creatinine due to crystal-induced kidney injury. Which antiviral is most associated with this adverse effect?",
    "choices": ["Acyclovir", "Oseltamivir", "Zidovudine", "Ritonavir"],
    "answerIndex": 0,
    "explanation": "Acyclovir can precipitate in renal tubules causing crystal nephropathy, especially with dehydration or high doses. Adequate hydration helps reduce risk.",
    "reference": ""
  },
  {
    "id": "DCB1-0022",
    "category": "Antivirals",
    "difficulty": "Easy",
    "stem": "Which antiviral is a neuraminidase inhibitor used for influenza A and B?",
    "choices": ["Oseltamivir", "Acyclovir", "Ganciclovir", "Ribavirin"],
    "answerIndex": 0,
    "explanation": "Oseltamivir inhibits neuraminidase, reducing release of new influenza virions. It is used for influenza A and B.",
    "reference": ""
  },
  {
    "id": "DCB1-0023",
    "category": "Antivirals",
    "difficulty": "Medium",
    "stem": "A patient on HIV therapy develops anemia and neutropenia due to bone marrow suppression. Which medication is the most likely cause?",
    "choices": ["Zidovudine", "Efavirenz", "Enfuvirtide", "Raltegravir"],
    "answerIndex": 0,
    "explanation": "Zidovudine (AZT), an NRTI, is associated with bone marrow suppression leading to anemia and neutropenia.",
    "reference": ""
  },
  {
    "id": "DCB1-0024",
    "category": "Antivirals",
    "difficulty": "Hard",
    "stem": "A clinician uses a medication primarily to 'boost' levels of other antiretrovirals by strongly inhibiting CYP3A4. Which drug is used for this purpose?",
    "choices": ["Ritonavir", "Zidovudine", "Nevirapine", "Enfuvirtide"],
    "answerIndex": 0,
    "explanation": "Ritonavir is a protease inhibitor and potent CYP3A4 inhibitor commonly used as a pharmacokinetic booster, increasing levels of other antiretrovirals and raising interaction risk.",
    "reference": ""
  },
  {
    "id": "DCB1-0025",
    "category": "Endocrine",
    "difficulty": "Easy",
    "stem": "A medication increases insulin release by closing ATP-sensitive potassium channels in pancreatic beta cells. Which drug fits this mechanism?",
    "choices": ["Glyburide", "Metformin", "Acarbose", "Sitagliptin"],
    "answerIndex": 0,
    "explanation": "Sulfonylureas (e.g., glyburide) close KATP channels, depolarizing beta cells and increasing insulin secretion. A major risk is hypoglycemia.",
    "reference": ""
  },
  {
    "id": "DCB1-0026",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient with type 2 diabetes and advanced chronic kidney disease is taking metformin. Which serious adverse effect is of greatest concern in this setting?",
    "choices": ["Lactic acidosis", "Tendon rupture", "Pulmonary fibrosis", "Hyperprolactinemia"],
    "answerIndex": 0,
    "explanation": "Metformin can rarely cause lactic acidosis, with higher risk in significant renal impairment due to reduced drug clearance.",
    "reference": ""
  },
  {
    "id": "DCB1-0027",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient starts semaglutide for type 2 diabetes and experiences nausea and early satiety with weight loss. Which mechanism best explains this medication’s effects?",
    "choices": ["GLP-1 receptor agonism increasing insulin, decreasing glucagon, and slowing gastric emptying", "Closing KATP channels to trigger insulin release", "Inhibiting DPP-4 to increase incretin breakdown", "Blocking SGLT2 to increase glucose reabsorption"],
    "answerIndex": 0,
    "explanation": "GLP-1 receptor agonists increase glucose-dependent insulin secretion, decrease glucagon, slow gastric emptying, and often promote weight loss. They can cause GI upset and have been associated with pancreatitis risk.",
    "reference": ""
  },
  {
    "id": "DCB1-0028",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient taking empagliflozin develops recurrent genital yeast infections. What is the primary mechanism of this drug class?",
    "choices": ["Block SGLT2 in the proximal tubule to increase urinary glucose excretion", "Increase insulin secretion by closing KATP channels", "Activate PPAR-gamma to increase insulin sensitivity", "Inhibit alpha-glucosidase in the intestine"],
    "answerIndex": 0,
    "explanation": "SGLT2 inhibitors block glucose reabsorption in the proximal tubule, causing glycosuria. Adverse effects include genital mycotic infections, volume depletion, and (rarely) euglycemic DKA.",
    "reference": ""
  },
  {
    "id": "DCB1-0029",
    "category": "Endocrine",
    "difficulty": "Hard",
    "stem": "A patient in the first trimester of pregnancy is diagnosed with hyperthyroidism requiring medication. Which drug is generally preferred early in pregnancy due to lower teratogenic risk and its additional effect on peripheral T4 to T3 conversion?",
    "choices": ["Propylthiouracil (PTU)", "Methimazole", "Levothyroxine", "Iodine-131"],
    "answerIndex": 0,
    "explanation": "PTU and methimazole inhibit thyroid peroxidase; PTU also inhibits peripheral conversion of T4 to T3. PTU is generally preferred in the first trimester (methimazole has greater teratogenic concern early), while PTU carries hepatotoxicity risk.",
    "reference": ""
  },
  {
    "id": "DCB1-0030",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient with type 2 diabetes is started on pioglitazone and later develops weight gain and peripheral edema. What is the primary mechanism of this medication?",
    "choices": ["Activate PPAR-gamma to increase insulin sensitivity", "Inhibit hepatic gluconeogenesis", "Block DPP-4 to increase incretin levels", "Close KATP channels to increase insulin release"],
    "answerIndex": 0,
    "explanation": "Thiazolidinediones (e.g., pioglitazone) activate PPAR-gamma, increasing insulin sensitivity in adipose and muscle. Adverse effects include weight gain, edema, and heart failure exacerbation risk.",
    "reference": ""
  },
  {
    "id": "DCB1-0031",
    "category": "Neuro/Psych",
    "difficulty": "Easy",
    "stem": "A patient starts sertraline for depression and later reports decreased libido and difficulty achieving orgasm. This adverse effect is most characteristic of which medication class?",
    "choices": ["SSRIs", "Benzodiazepines", "Atypical antipsychotics", "Tricyclic antidepressants"],
    "answerIndex": 0,
    "explanation": "SSRIs commonly cause sexual dysfunction (decreased libido, delayed orgasm), along with GI upset and possible insomnia.",
    "reference": ""
  },
  {
    "id": "DCB1-0032",
    "category": "Neuro/Psych",
    "difficulty": "Medium",
    "stem": "Which medication combination carries the highest risk of serotonin syndrome?",
    "choices": ["Sertraline and phenelzine", "Bupropion and gabapentin", "Olanzapine and lithium", "Lorazepam and zolpidem"],
    "answerIndex": 0,
    "explanation": "Combining an SSRI with an MAOI markedly increases serotonin and can cause serotonin syndrome (e.g., agitation, hyperreflexia/clonus, autonomic instability, diarrhea).",
    "reference": ""
  },
  {
    "id": "DCB1-0033",
    "category": "Neuro/Psych",
    "difficulty": "Medium",
    "stem": "A patient develops acute neck stiffness and oculogyric crisis shortly after starting a high-potency antipsychotic. Which medication is used to treat this adverse effect?",
    "choices": ["Benztropine", "Naloxone", "Idarucizumab", "N-acetylcysteine"],
    "answerIndex": 0,
    "explanation": "Acute dystonia is an extrapyramidal side effect of dopamine blockade. Treatment is an anticholinergic (benztropine) or an antihistamine with anticholinergic properties (diphenhydramine).",
    "reference": ""
  },
  {
    "id": "DCB1-0034",
    "category": "Neuro/Psych",
    "difficulty": "Medium",
    "stem": "A patient on an antipsychotic develops galactorrhea and amenorrhea. Which medication is most associated with hyperprolactinemia?",
    "choices": ["Risperidone", "Clozapine", "Quetiapine", "Aripiprazole"],
    "answerIndex": 0,
    "explanation": "Risperidone commonly increases prolactin due to dopamine D2 antagonism. Aripiprazole is a partial agonist and tends to have less prolactin elevation.",
    "reference": ""
  },
  {
    "id": "DCB1-0035",
    "category": "Neuro/Psych",
    "difficulty": "Hard",
    "stem": "A patient taking lithium develops polyuria and polydipsia consistent with nephrogenic diabetes insipidus. Which medication can help treat lithium-induced nephrogenic DI by blocking lithium entry into collecting duct cells?",
    "choices": ["Amiloride", "Furosemide", "Desmopressin", "Acetazolamide"],
    "answerIndex": 0,
    "explanation": "Lithium can cause nephrogenic DI. Amiloride blocks ENaC in the collecting duct, reducing lithium uptake into principal cells and helping mitigate DI.",
    "reference": ""
  },
  {
    "id": "DCB1-0036",
    "category": "Neuro/Psych",
    "difficulty": "Medium",
    "stem": "A patient with epilepsy becomes pregnant and is concerned about fetal risk from medications. Which antiseizure medication is strongly associated with neural tube defects and is generally avoided in pregnancy when possible?",
    "choices": ["Valproate", "Levetiracetam", "Lamotrigine", "Gabapentin"],
    "answerIndex": 0,
    "explanation": "Valproate is associated with neural tube defects and other teratogenic risks, along with hepatotoxicity and pancreatitis risk. Pregnancy planning often involves selecting safer alternatives when appropriate.",
    "reference": ""
  },
  {
    "id": "DCB1-0037",
    "category": "Respiratory",
    "difficulty": "Easy",
    "stem": "A patient uses an albuterol inhaler and develops tremor and palpitations. Which electrolyte abnormality can also occur due to this medication?",
    "choices": ["Hypokalemia", "Hyperkalemia", "Hypercalcemia", "Hyponatremia"],
    "answerIndex": 0,
    "explanation": "Beta-2 agonists drive potassium into cells, which can lead to hypokalemia, along with tremor and tachycardia/palpitations.",
    "reference": ""
  },
  {
    "id": "DCB1-0038",
    "category": "Respiratory",
    "difficulty": "Easy",
    "stem": "A patient using an inhaled corticosteroid develops white plaques in the mouth consistent with candidiasis. Which counseling helps prevent this adverse effect?",
    "choices": ["Rinse the mouth after inhalation (and consider a spacer)", "Take the medication with milk to reduce irritation", "Avoid sunlight due to photosensitivity", "Take with alcohol to improve absorption"],
    "answerIndex": 0,
    "explanation": "Inhaled corticosteroids can cause oral candidiasis and dysphonia. Rinsing the mouth and using a spacer can reduce local steroid deposition and risk of thrush.",
    "reference": ""
  },
  {
    "id": "DCB1-0039",
    "category": "Respiratory",
    "difficulty": "Medium",
    "stem": "A patient with COPD is started on ipratropium for symptom control. What is the primary mechanism of ipratropium?",
    "choices": ["Muscarinic receptor antagonism causing bronchodilation", "Beta-2 receptor agonism increasing cAMP", "Leukotriene receptor antagonism reducing inflammation", "Direct inhibition of histamine release from mast cells"],
    "answerIndex": 0,
    "explanation": "Ipratropium is an inhaled antimuscarinic (primarily M3 blockade), leading to bronchodilation. Common adverse effects include dry mouth and urinary retention in susceptible patients.",
    "reference": ""
  },
  {
    "id": "DCB1-0040",
    "category": "Respiratory",
    "difficulty": "Hard",
    "stem": "A patient taking theophylline for asthma develops nausea, tremor, and an arrhythmia after starting a new medication that raises theophylline levels. Which medication is most likely responsible?",
    "choices": ["Cimetidine", "Montelukast", "Albuterol", "Ipratropium"],
    "answerIndex": 0,
    "explanation": "Theophylline has a narrow therapeutic index and is metabolized by CYP enzymes. CYP inhibitors (e.g., cimetidine, some macrolides) can increase levels and cause toxicity (arrhythmias, seizures, GI symptoms).",
    "reference": ""
  },
  {
    "id": "DCB1-0041",
    "category": "GI",
    "difficulty": "Easy",
    "stem": "Proton pump inhibitors (PPIs) reduce gastric acid secretion by which mechanism?",
    "choices": ["Irreversibly inhibit the H+/K+ ATPase in parietal cells", "Reversibly block H2 receptors on parietal cells", "Neutralize acid directly as weak bases", "Increase prostaglandin synthesis in the gastric mucosa"],
    "answerIndex": 0,
    "explanation": "PPIs irreversibly inhibit the gastric proton pump (H+/K+ ATPase), producing potent acid suppression.",
    "reference": ""
  },
  {
    "id": "DCB1-0042",
    "category": "GI",
    "difficulty": "Medium",
    "stem": "A patient with a history of NSAID-induced ulcers is given misoprostol. Which adverse effect or caution is most important to counsel about?",
    "choices": ["Diarrhea and contraindication in pregnancy due to uterine contractions", "Severe photosensitivity and tooth discoloration", "Tendon rupture risk", "Pulmonary fibrosis"],
    "answerIndex": 0,
    "explanation": "Misoprostol is a prostaglandin E1 analog that protects gastric mucosa but can cause diarrhea and uterine contractions; it is contraindicated in pregnancy.",
    "reference": ""
  },
  {
    "id": "DCB1-0043",
    "category": "GI",
    "difficulty": "Medium",
    "stem": "A patient with diabetic gastroparesis is treated with metoclopramide and later develops involuntary muscle contractions and restlessness. What explains this adverse effect?",
    "choices": ["D2 receptor antagonism causing extrapyramidal symptoms", "Irreversible inhibition of the proton pump", "Direct smooth muscle relaxation via nitric oxide release", "Inhibition of intestinal brush border enzymes"],
    "answerIndex": 0,
    "explanation": "Metoclopramide is a D2 antagonist (and prokinetic). Dopamine blockade can cause extrapyramidal symptoms and tardive dyskinesia risk, especially with prolonged use.",
    "reference": ""
  },
  {
    "id": "DCB1-0044",
    "category": "Hematology/Anticoag",
    "difficulty": "Medium",
    "stem": "A patient is started on warfarin for atrial fibrillation. Which statement best describes warfarin’s mechanism and monitoring?",
    "choices": ["Inhibits vitamin K epoxide reductase and is monitored with INR", "Directly inhibits thrombin and is monitored with aPTT", "Activates antithrombin and is monitored with aPTT", "Inhibits platelet ADP receptors and is monitored with bleeding time"],
    "answerIndex": 0,
    "explanation": "Warfarin inhibits vitamin K epoxide reductase, decreasing activation of vitamin K–dependent clotting factors (II, VII, IX, X) and proteins C and S. Anticoagulant effect is monitored using PT/INR. Warfarin is teratogenic.",
    "reference": ""
  },
  {
    "id": "DCB1-0045",
    "category": "Rheum/Immunology",
    "difficulty": "Medium",
    "stem": "A patient with rheumatoid arthritis is treated with methotrexate and develops oral ulcers and low blood counts. Which supplement can reduce some toxicity, and what is the primary mechanism of methotrexate?",
    "choices": ["Folinic acid (leucovorin) rescue; inhibits dihydrofolate reductase", "Vitamin B12; inhibits HMG-CoA reductase", "Vitamin C; blocks beta-1,3-D-glucan synthesis", "Niacin; inhibits DNA gyrase"],
    "answerIndex": 0,
    "explanation": "Methotrexate inhibits dihydrofolate reductase, impairing DNA synthesis. Toxicities include mucositis and myelosuppression; folic acid supplementation is commonly used, and folinic acid (leucovorin) can be used as rescue in significant toxicity.",
    "reference": ""
  },
  {
    "id": "DCB1-0046",
    "category": "Rheum/Immunology",
    "difficulty": "Medium",
    "stem": "A patient is about to start a TNF-alpha inhibitor for inflammatory arthritis. Which screening is most important prior to therapy due to risk of reactivation?",
    "choices": ["Latent tuberculosis screening", "Serum sodium screening", "Pulmonary function testing for restrictive disease", "Urine toxicology screening"],
    "answerIndex": 0,
    "explanation": "TNF-alpha inhibitors (e.g., infliximab, adalimumab, etanercept) increase the risk of serious infections and can reactivate latent TB, so screening is required before initiation.",
    "reference": ""
  },
  {
    "id": "DCB1-0047",
    "category": "Rheum/Immunology",
    "difficulty": "Hard",
    "stem": "A transplant patient is taking cyclosporine. Which mechanism and adverse effect profile best matches this medication?",
    "choices": ["Calcineurin inhibition leading to decreased IL-2 transcription; nephrotoxicity and gingival hyperplasia", "JAK inhibition; severe tendon rupture", "TNF-alpha blockade; irreversible ototoxicity", "Inhibition of DNA gyrase; pulmonary fibrosis"],
    "answerIndex": 0,
    "explanation": "Cyclosporine inhibits calcineurin, decreasing IL-2 transcription and T-cell activation. Notable adverse effects include nephrotoxicity, hypertension, tremor, hirsutism, and gingival hyperplasia.",
    "reference": ""
  },
  {
    "id": "DCB1-0048",
    "category": "Oncology",
    "difficulty": "Hard",
    "stem": "A patient receiving chemotherapy develops a dose-dependent dilated cardiomyopathy. Which drug is most likely responsible, and which agent can be used to reduce this toxicity?",
    "choices": ["Doxorubicin; dexrazoxane", "Cisplatin; leucovorin", "Bleomycin; mesna", "Vincristine; flumazenil"],
    "answerIndex": 0,
    "explanation": "Doxorubicin (an anthracycline) can cause cardiomyopathy via free radical injury. Dexrazoxane can reduce anthracycline cardiotoxicity.",
    "reference": ""
  },
  {
    "id": "DCB1-0049",
    "category": "Oncology",
    "difficulty": "Medium",
    "stem": "A patient receiving bleomycin develops progressive dyspnea and a dry cough. Which toxicity is most characteristic of this drug?",
    "choices": ["Pulmonary fibrosis", "Hemorrhagic cystitis", "Peripheral neuropathy", "Severe hypoglycemia"],
    "answerIndex": 0,
    "explanation": "Bleomycin is associated with pulmonary toxicity (pneumonitis/fibrosis) and mucocutaneous effects, with relatively less myelosuppression compared with many other chemotherapies.",
    "reference": ""
  },
  {
    "id": "DCB1-0050",
    "category": "Oncology",
    "difficulty": "Medium",
    "stem": "A patient on chemotherapy develops constipation, ileus, and peripheral neuropathy. Which chemotherapy agent is most associated with this pattern of toxicity?",
    "choices": ["Vincristine", "Methotrexate", "Doxorubicin", "Bleomycin"],
    "answerIndex": 0,
    "explanation": "Vincristine (a microtubule inhibitor) commonly causes peripheral neuropathy and constipation/ileus. It has less myelosuppression than many other agents.",
    "reference": ""
  }
,
  {
    "id": "DCB2-0001",
    "category": "Renal",
    "difficulty": "Medium",
    "stem": "A 71-year-old with hypertension and chronic heart failure takes lisinopril and furosemide. After starting ibuprofen for back pain, their creatinine rises significantly. Which medication most directly caused decreased renal blood flow via afferent arteriole constriction?",
    "choices": ["Lisinopril", "Ibuprofen", "Furosemide", "Amlodipine"],
    "answerIndex": 1,
    "explanation": "NSAIDs (e.g., ibuprofen) reduce prostaglandin synthesis, which can constrict the afferent arteriole and lower GFR. Combined with ACE inhibitors (efferent dilation) and diuretics (lower intravascular volume), the risk of acute kidney injury increases.",
    "reference": ""
  },
  {
    "id": "DCB2-0002",
    "category": "Diuretics",
    "difficulty": "Easy",
    "stem": "A patient with acute pulmonary edema receives an IV diuretic that inhibits the Na+/K+/2Cl− cotransporter in the thick ascending limb. Which medication was given?",
    "choices": ["Furosemide", "Spironolactone", "Hydrochlorothiazide", "Acetazolamide"],
    "answerIndex": 0,
    "explanation": "Loop diuretics (e.g., furosemide) inhibit the Na+/K+/2Cl− cotransporter (NKCC2) in the thick ascending limb. They are potent diuretics used in pulmonary edema and can cause hypokalemia, metabolic alkalosis, and ototoxicity.",
    "reference": ""
  },
  {
    "id": "DCB2-0003",
    "category": "Diuretics",
    "difficulty": "Medium",
    "stem": "A patient has recurrent calcium oxalate kidney stones due to hypercalciuria. Which diuretic can help reduce urinary calcium excretion?",
    "choices": ["Furosemide", "Hydrochlorothiazide", "Mannitol", "Spironolactone"],
    "answerIndex": 1,
    "explanation": "Thiazide diuretics (e.g., hydrochlorothiazide) increase calcium reabsorption in the distal convoluted tubule, reducing urinary calcium and helping prevent calcium stone formation in hypercalciuria.",
    "reference": ""
  },
  {
    "id": "DCB2-0004",
    "category": "Diuretics",
    "difficulty": "Medium",
    "stem": "A patient with cirrhosis-related ascites is started on spironolactone and later develops gynecomastia. What is the primary renal mechanism of spironolactone?",
    "choices": ["Directly blocks ENaC channels in the collecting duct", "Antagonizes aldosterone receptors in the collecting duct", "Inhibits NKCC2 in the thick ascending limb", "Inhibits carbonic anhydrase in the proximal tubule"],
    "answerIndex": 1,
    "explanation": "Spironolactone is an aldosterone receptor antagonist in the collecting duct. It decreases sodium reabsorption and potassium secretion. Antiandrogen effects can cause gynecomastia and sexual side effects.",
    "reference": ""
  },
  {
    "id": "DCB2-0005",
    "category": "Hematology/Anticoag",
    "difficulty": "Easy",
    "stem": "A patient is started on an unfractionated heparin infusion for treatment of a pulmonary embolism. Which lab test is typically used to monitor the anticoagulant effect?",
    "choices": ["PT/INR", "aPTT", "Bleeding time", "D-dimer"],
    "answerIndex": 1,
    "explanation": "Unfractionated heparin potentiates antithrombin and is commonly monitored with aPTT (or anti-Xa level depending on institution). Warfarin is monitored with PT/INR.",
    "reference": ""
  },
  {
    "id": "DCB2-0006",
    "category": "Hematology/Anticoag",
    "difficulty": "Medium",
    "stem": "A patient taking dabigatran develops life-threatening gastrointestinal bleeding. Which reversal agent specifically neutralizes dabigatran?",
    "choices": ["Protamine sulfate", "Idarucizumab", "Vitamin K", "Andexanet alfa"],
    "answerIndex": 1,
    "explanation": "Idarucizumab is a monoclonal antibody fragment that binds dabigatran and reverses its anticoagulant effect. Protamine reverses heparin; vitamin K reverses warfarin; andexanet alfa reverses factor Xa inhibitors.",
    "reference": ""
  },
  {
    "id": "DCB2-0007",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient treated for acne reports severe photosensitivity after starting an antibiotic. Which medication is most associated with photosensitivity and tooth discoloration?",
    "choices": ["Doxycycline", "Amoxicillin", "Gentamicin", "Azithromycin"],
    "answerIndex": 0,
    "explanation": "Tetracyclines (e.g., doxycycline) can cause photosensitivity and tooth discoloration (especially with exposure during tooth development). They also chelate divalent cations and should not be taken with calcium/iron supplements.",
    "reference": ""
  },
  {
    "id": "DCB2-0008",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient started on isoniazid for latent tuberculosis develops tingling and numbness in the feet. Which supplement helps prevent this adverse effect?",
    "choices": ["Pyridoxine (vitamin B6)", "Folinic acid (leucovorin)", "Thiamine (vitamin B1)", "Cyanocobalamin (vitamin B12)"],
    "answerIndex": 0,
    "explanation": "Isoniazid can cause peripheral neuropathy by depleting vitamin B6. Pyridoxine supplementation helps prevent and treat this neuropathy.",
    "reference": ""
  },
  {
    "id": "DCB2-0009",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient treated for tuberculosis notices orange discoloration of urine and tears. They are also warned that their oral contraceptive may be less effective. Which mechanism explains this interaction?",
    "choices": ["Strong CYP450 induction", "Strong CYP450 inhibition", "Direct inhibition of DNA gyrase", "Chelation of divalent cations in the gut"],
    "answerIndex": 0,
    "explanation": "Rifampin is a strong CYP450 inducer, which can lower levels of many drugs including oral contraceptives, anticoagulants, and antiretrovirals. It also causes orange body fluids.",
    "reference": ""
  },
  {
    "id": "DCB2-0010",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient taking an antibiotic for atypical pneumonia develops QT prolongation and is told the antibiotic can increase levels of other drugs by inhibiting CYP3A4. Which antibiotic is most consistent with this profile?",
    "choices": ["Erythromycin", "Amoxicillin", "Nitrofurantoin", "Metronidazole"],
    "answerIndex": 0,
    "explanation": "Erythromycin (a macrolide) can inhibit CYP3A4 and prolong the QT interval. Macrolides can also cause GI upset due to increased motilin effects.",
    "reference": ""
  },
  {
    "id": "DCB2-0011",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A 27-year-old with uncomplicated cystitis is prescribed an antibiotic that concentrates in urine and is generally not used for pyelonephritis due to poor tissue penetration. Which antibiotic was most likely prescribed?",
    "choices": ["Nitrofurantoin", "Ceftriaxone", "Azithromycin", "Clindamycin"],
    "answerIndex": 0,
    "explanation": "Nitrofurantoin is commonly used for uncomplicated cystitis and concentrates in urine. It is not appropriate for pyelonephritis because it does not achieve adequate renal tissue levels.",
    "reference": ""
  },
  {
    "id": "DCB2-0012",
    "category": "Endocrine",
    "difficulty": "Easy",
    "stem": "A patient with diabetes needs a rapid-acting mealtime insulin with fast onset and short duration. Which insulin is best?",
    "choices": ["Insulin glargine", "Insulin lispro", "NPH insulin", "Insulin detemir"],
    "answerIndex": 1,
    "explanation": "Rapid-acting insulins (lispro, aspart, glulisine) are used for mealtime coverage because of fast onset and short duration. Glargine and detemir are long-acting basal insulins.",
    "reference": ""
  },
  {
    "id": "DCB2-0013",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient is started on a basal insulin that provides long-acting coverage with minimal peak to reduce nighttime hypoglycemia. Which insulin best fits this description?",
    "choices": ["Regular insulin", "NPH insulin", "Insulin glargine", "Insulin lispro"],
    "answerIndex": 2,
    "explanation": "Insulin glargine is long-acting with relatively flat (peakless) activity and is commonly used as basal insulin.",
    "reference": ""
  },
  {
    "id": "DCB2-0014",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient with primary adrenal insufficiency has persistent hypotension and hyperkalemia due to low aldosterone. Which medication provides mineralocorticoid replacement?",
    "choices": ["Fludrocortisone", "Prednisone", "Dexamethasone", "Ketoconazole"],
    "answerIndex": 0,
    "explanation": "Fludrocortisone has strong mineralocorticoid activity and is used to replace aldosterone in primary adrenal insufficiency.",
    "reference": ""
  },
  {
    "id": "DCB2-0015",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient has been taking high-dose prednisone for several months and is instructed not to stop it abruptly. Why is tapering required?",
    "choices": ["To prevent acute renal failure from hyperkalemia", "To prevent adrenal crisis from HPA axis suppression", "To prevent immediate severe hypertension from catecholamine excess", "To prevent serotonin syndrome"],
    "answerIndex": 1,
    "explanation": "Chronic glucocorticoid use suppresses the HPA axis (low endogenous ACTH and cortisol). Abrupt discontinuation can cause adrenal insufficiency/adrenal crisis, so tapering is needed.",
    "reference": ""
  },
  {
    "id": "DCB2-0016",
    "category": "Autonomic",
    "difficulty": "Medium",
    "stem": "A farm worker presents with salivation, lacrimation, urination, diarrhea, bronchospasm, and miosis after pesticide exposure. Which treatment is most appropriate?",
    "choices": ["Atropine plus pralidoxime", "Naloxone plus flumazenil", "Physostigmine plus atropine", "Epinephrine plus propranolol"],
    "answerIndex": 0,
    "explanation": "Organophosphate poisoning causes acetylcholinesterase inhibition, leading to excess acetylcholine. Atropine treats muscarinic symptoms, and pralidoxime regenerates acetylcholinesterase (especially if given early).",
    "reference": ""
  },
  {
    "id": "DCB2-0017",
    "category": "Anesthesia",
    "difficulty": "Hard",
    "stem": "During surgery, a patient develops hyperthermia, muscle rigidity, hypercapnia, and metabolic acidosis after receiving a volatile anesthetic and succinylcholine. Which medication treats this condition?",
    "choices": ["Dantrolene", "Naloxone", "Physostigmine", "Protamine sulfate"],
    "answerIndex": 0,
    "explanation": "Malignant hyperthermia is due to uncontrolled calcium release from the sarcoplasmic reticulum (often linked to ryanodine receptor dysfunction). Dantrolene treats it by reducing calcium release.",
    "reference": ""
  },
  {
    "id": "DCB2-0018",
    "category": "Pain/Anesthesia",
    "difficulty": "Easy",
    "stem": "A patient is found unresponsive with pinpoint pupils and severe respiratory depression after taking an unknown substance. Which medication is most appropriate for immediate reversal?",
    "choices": ["Naloxone", "Flumazenil", "Atropine", "Fomepizole"],
    "answerIndex": 0,
    "explanation": "This presentation is classic for opioid toxicity. Naloxone is a rapid opioid receptor antagonist used for reversal.",
    "reference": ""
  },
  {
    "id": "DCB2-0019",
    "category": "Toxicology",
    "difficulty": "Easy",
    "stem": "A patient presents after taking a large amount of acetaminophen and has elevated aminotransferases. Which antidote replenishes glutathione and prevents liver injury?",
    "choices": ["N-acetylcysteine", "Deferoxamine", "Methylene blue", "Vitamin K"],
    "answerIndex": 0,
    "explanation": "N-acetylcysteine replenishes glutathione and detoxifies the reactive acetaminophen metabolite (NAPQI), reducing hepatic injury risk.",
    "reference": ""
  },
  {
    "id": "DCB2-0020",
    "category": "Neuro/Psych",
    "difficulty": "Hard",
    "stem": "A patient with Parkinson disease experiences end-of-dose 'wearing off' on levodopa/carbidopa. A medication is added to prolong levodopa’s effect by inhibiting its peripheral metabolism. Which mechanism best describes this add-on therapy?",
    "choices": ["COMT inhibition to prolong levodopa availability", "MAO-A inhibition to increase serotonin", "D2 receptor antagonism to reduce tremor", "Acetylcholinesterase inhibition to increase acetylcholine"],
    "answerIndex": 0,
    "explanation": "COMT inhibitors (e.g., entacapone) reduce peripheral levodopa breakdown, increasing availability and helping with wearing-off. They can cause diarrhea and may discolor urine.",
    "reference": ""
  },
  {
    "id": "DCB2-0021",
    "category": "Neuro/Psych",
    "difficulty": "Hard",
    "stem": "A patient is brought to the ED after an amitriptyline overdose. ECG shows a widened QRS complex and the patient has hypotension and seizures. Which treatment is most appropriate?",
    "choices": ["IV sodium bicarbonate", "Naloxone", "Vitamin K", "N-acetylcysteine"],
    "answerIndex": 0,
    "explanation": "Tricyclic antidepressant toxicity causes sodium channel blockade leading to wide QRS and ventricular arrhythmias. Sodium bicarbonate is used to narrow the QRS and treat cardiotoxicity.",
    "reference": ""
  },
  {
    "id": "DCB2-0022",
    "category": "Neuro/Psych",
    "difficulty": "Medium",
    "stem": "A patient is excessively sedated after taking a large dose of diazepam. Which medication can reverse benzodiazepine effects at the GABA-A receptor benzodiazepine binding site?",
    "choices": ["Flumazenil", "Naloxone", "Protamine sulfate", "Atropine"],
    "answerIndex": 0,
    "explanation": "Flumazenil is a competitive antagonist at the benzodiazepine binding site on GABA-A receptors. It can precipitate seizures in benzodiazepine-dependent patients, so it must be used cautiously.",
    "reference": ""
  },
  {
    "id": "DCB2-0023",
    "category": "Neuro/Psych",
    "difficulty": "Hard",
    "stem": "A patient with treatment-resistant schizophrenia is started on clozapine. Several weeks later they develop fever and sore throat. Which serious adverse effect is most concerning and requires regular monitoring?",
    "choices": ["Agranulocytosis (severe neutropenia)", "Pulmonary fibrosis", "Ototoxicity", "Nephrolithiasis"],
    "answerIndex": 0,
    "explanation": "Clozapine can cause agranulocytosis, so regular absolute neutrophil count (ANC) monitoring is required. Clozapine can also cause seizures, myocarditis, and significant metabolic side effects.",
    "reference": ""
  },
  {
    "id": "DCB2-0024",
    "category": "Neuro/Psych",
    "difficulty": "Easy",
    "stem": "A patient wants an antidepressant that is less likely to cause sexual dysfunction and also helps with smoking cessation. Which medication best fits?",
    "choices": ["Bupropion", "Sertraline", "Paroxetine", "Phenelzine"],
    "answerIndex": 0,
    "explanation": "Bupropion (a norepinephrine-dopamine reuptake inhibitor) is often less associated with sexual side effects and is used for smoking cessation. It can lower the seizure threshold.",
    "reference": ""
  },
  {
    "id": "DCB2-0025",
    "category": "Respiratory",
    "difficulty": "Medium",
    "stem": "A patient with asthma and aspirin-exacerbated respiratory symptoms needs an add-on controller medication. Which drug blocks leukotriene receptors to reduce bronchoconstriction?",
    "choices": ["Montelukast", "Albuterol", "Omalizumab", "Ipratropium"],
    "answerIndex": 0,
    "explanation": "Montelukast is a leukotriene receptor antagonist that can help with asthma control, including aspirin-exacerbated respiratory disease. Neuropsychiatric side effects have been reported, so counseling is important.",
    "reference": ""
  },
  {
    "id": "DCB2-0026",
    "category": "Allergy/Immunology",
    "difficulty": "Easy",
    "stem": "A patient develops hypotension, wheezing, and diffuse urticaria after a bee sting. What is the most important immediate medication?",
    "choices": ["Intramuscular epinephrine", "Diphenhydramine", "Albuterol nebulizer", "Oral prednisone"],
    "answerIndex": 0,
    "explanation": "Intramuscular epinephrine is first-line treatment for anaphylaxis. Antihistamines and steroids can be adjuncts but should not replace epinephrine.",
    "reference": ""
  },
  {
    "id": "DCB2-0027",
    "category": "GI",
    "difficulty": "Easy",
    "stem": "A traveler has acute non-bloody diarrhea and wants symptomatic relief. Which OTC medication slows intestinal motility by acting on peripheral mu-opioid receptors?",
    "choices": ["Loperamide", "Lactulose", "Metoclopramide", "Ondansetron"],
    "answerIndex": 0,
    "explanation": "Loperamide is a peripheral mu-opioid receptor agonist that reduces gut motility with minimal CNS penetration at usual doses.",
    "reference": ""
  },
  {
    "id": "DCB2-0028",
    "category": "GI",
    "difficulty": "Medium",
    "stem": "A patient with cirrhosis presents with confusion due to hepatic encephalopathy. Which medication reduces ammonia by trapping it in the gut and increasing excretion?",
    "choices": ["Lactulose", "Omeprazole", "Loperamide", "Sucralfate"],
    "answerIndex": 0,
    "explanation": "Lactulose acidifies the colon and traps ammonia (NH3) as ammonium (NH4+), promoting fecal excretion. It also acts as an osmotic laxative, reducing time for ammonia absorption.",
    "reference": ""
  },
  {
    "id": "DCB2-0029",
    "category": "Oncology",
    "difficulty": "Medium",
    "stem": "A patient receiving cyclophosphamide develops dysuria and hematuria due to hemorrhagic cystitis. Which medication is given to prevent this toxicity?",
    "choices": ["Mesna", "Leucovorin", "Amifostine", "Dexrazoxane"],
    "answerIndex": 0,
    "explanation": "Mesna binds and detoxifies acrolein, a cyclophosphamide metabolite responsible for hemorrhagic cystitis. Aggressive hydration is also important.",
    "reference": ""
  },
  {
    "id": "DCB2-0030",
    "category": "Oncology",
    "difficulty": "Hard",
    "stem": "A patient receiving cisplatin develops rising creatinine and tinnitus. Which cytoprotective agent can reduce cisplatin-induced nephrotoxicity?",
    "choices": ["Amifostine", "Mesna", "Dexrazoxane", "Folinic acid (leucovorin)"],
    "answerIndex": 0,
    "explanation": "Cisplatin can cause nephrotoxicity and ototoxicity. Amifostine is used as a protective agent to reduce cisplatin-related nephrotoxicity in appropriate settings.",
    "reference": ""
  },
  {
    "id": "DCB2-0031",
    "category": "Oncology",
    "difficulty": "Medium",
    "stem": "A chemotherapy agent causes myelosuppression and mucositis by inhibiting thymidylate synthase, decreasing dTMP synthesis. Which agent is most likely responsible?",
    "choices": ["5-Fluorouracil", "Cyclophosphamide", "Vincristine", "Bleomycin"],
    "answerIndex": 0,
    "explanation": "5-Fluorouracil (5-FU) inhibits thymidylate synthase, decreasing dTMP and impairing DNA synthesis. It commonly causes mucositis and myelosuppression.",
    "reference": ""
  },
  {
    "id": "DCB2-0032",
    "category": "Immunology/Transplant",
    "difficulty": "Medium",
    "stem": "A transplant patient is prescribed sirolimus. Which mechanism best describes this drug?",
    "choices": ["mTOR inhibition blocking IL-2–mediated T-cell proliferation", "Calcineurin inhibition decreasing IL-2 transcription", "Inhibition of IMP dehydrogenase decreasing guanine synthesis", "TNF-alpha neutralization"],
    "answerIndex": 0,
    "explanation": "Sirolimus inhibits mTOR, blocking IL-2 signal transduction and T-cell proliferation. Adverse effects can include hyperlipidemia and bone marrow suppression; it is generally less nephrotoxic than calcineurin inhibitors.",
    "reference": ""
  },
  {
    "id": "DCB2-0033",
    "category": "Immunology/Transplant",
    "difficulty": "Hard",
    "stem": "A patient is started on mycophenolate mofetil after kidney transplantation. Which mechanism best explains its immunosuppressive effects?",
    "choices": ["Inhibits IMP dehydrogenase, decreasing de novo guanine synthesis in lymphocytes", "Inhibits calcineurin, decreasing IL-2 transcription", "Blocks CD28 costimulation", "Neutralizes TNF-alpha"],
    "answerIndex": 0,
    "explanation": "Mycophenolate inhibits IMP dehydrogenase, reducing de novo guanine synthesis. Because lymphocytes rely heavily on de novo purine synthesis, this suppresses lymphocyte proliferation. It can cause GI upset and bone marrow suppression.",
    "reference": ""
  },
  {
    "id": "DCB2-0034",
    "category": "Lipids",
    "difficulty": "Easy",
    "stem": "A patient starts niacin for dyslipidemia and experiences intense flushing and warmth. Which medication can be taken beforehand to reduce flushing?",
    "choices": ["Aspirin", "Acetaminophen", "Vitamin K", "Naloxone"],
    "answerIndex": 0,
    "explanation": "Niacin-induced flushing is mediated by prostaglandins; aspirin can reduce flushing when taken beforehand. Niacin can also worsen hyperglycemia and increase uric acid.",
    "reference": ""
  },
  {
    "id": "DCB2-0035",
    "category": "Lipids",
    "difficulty": "Medium",
    "stem": "A lipid-lowering agent activates PPAR-alpha to lower triglycerides but can increase the risk of gallstones and myopathy (especially with statins). Which drug fits this description?",
    "choices": ["Gemfibrozil", "Ezetimibe", "Cholestyramine", "Niacin"],
    "answerIndex": 0,
    "explanation": "Fibrates (gemfibrozil, fenofibrate) activate PPAR-alpha, lowering triglycerides. Key adverse effects include myopathy and cholesterol gallstones.",
    "reference": ""
  },
  {
    "id": "DCB2-0036",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient on lisinopril develops hyperkalemia after starting an antibiotic for a urinary tract infection. Which antibiotic can cause hyperkalemia by acting similarly to a potassium-sparing diuretic in the collecting duct?",
    "choices": ["Trimethoprim-sulfamethoxazole", "Nitrofurantoin", "Doxycycline", "Cefazolin"],
    "answerIndex": 0,
    "explanation": "Trimethoprim can reduce potassium excretion (similar to ENaC blockade), increasing the risk of hyperkalemia, especially when combined with ACE inhibitors, ARBs, or potassium-sparing diuretics.",
    "reference": ""
  },
  {
    "id": "DCB2-0037",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient with a history of anaphylaxis to penicillin needs treatment for streptococcal pharyngitis. Which option is the safest alternative from the list?",
    "choices": ["Amoxicillin", "Cephalexin", "Azithromycin", "Penicillin V"],
    "answerIndex": 2,
    "explanation": "In a patient with true anaphylaxis to penicillin, a non–beta-lactam alternative such as a macrolide (azithromycin) is commonly used. Beta-lactams (penicillins and some cephalosporins) may carry cross-reactivity risk in severe allergy histories.",
    "reference": ""
  },
  {
    "id": "DCB2-0038",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient with cryptococcal meningitis is treated with flucytosine as part of combination therapy. Which adverse effect is most associated with flucytosine?",
    "choices": ["Bone marrow suppression", "Severe nephrotoxicity with electrolyte wasting", "Tendon rupture", "Ototoxicity"],
    "answerIndex": 0,
    "explanation": "Flucytosine can cause bone marrow suppression. It is often used with amphotericin B for severe cryptococcal infections.",
    "reference": ""
  },
  {
    "id": "DCB2-0039",
    "category": "Antivirals",
    "difficulty": "Medium",
    "stem": "A patient with AIDS develops CMV retinitis and is started on therapy. Which antiviral is commonly used and is associated with neutropenia and bone marrow suppression?",
    "choices": ["Ganciclovir", "Acyclovir", "Oseltamivir", "Ribavirin"],
    "answerIndex": 0,
    "explanation": "Ganciclovir is used for CMV infections and can cause bone marrow suppression, including neutropenia.",
    "reference": ""
  },
  {
    "id": "DCB2-0040",
    "category": "Antivirals",
    "difficulty": "Hard",
    "stem": "A patient has ganciclovir-resistant CMV infection. Which antiviral can be used as an alternative and is associated with nephrotoxicity and hypocalcemia?",
    "choices": ["Foscarnet", "Acyclovir", "Zidovudine", "Lamivudine"],
    "answerIndex": 0,
    "explanation": "Foscarnet can treat ganciclovir-resistant CMV and acyclovir-resistant HSV. It can cause nephrotoxicity and electrolyte abnormalities such as hypocalcemia.",
    "reference": ""
  },
  {
    "id": "DCB2-0041",
    "category": "Cardiac",
    "difficulty": "Hard",
    "stem": "A patient with hypertensive emergency is treated with nitroprusside. Soon after, they develop confusion and severe metabolic acidosis. Which antidote helps treat the likely toxicity?",
    "choices": ["Sodium thiosulfate", "Vitamin K", "Protamine sulfate", "Flumazenil"],
    "answerIndex": 0,
    "explanation": "Nitroprusside can cause cyanide toxicity, presenting with altered mental status and metabolic acidosis. Antidotes include sodium thiosulfate (and hydroxocobalamin in some protocols).",
    "reference": ""
  },
  {
    "id": "DCB2-0042",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient with severe hyperthyroidism has tachycardia and tremor. Which medication both controls adrenergic symptoms and decreases peripheral conversion of T4 to T3?",
    "choices": ["Propranolol", "Atenolol", "Digoxin", "Amlodipine"],
    "answerIndex": 0,
    "explanation": "Propranolol is a nonselective beta blocker that controls hyperthyroid symptoms and can reduce peripheral conversion of T4 to T3 at higher doses.",
    "reference": ""
  },
  {
    "id": "DCB2-0043",
    "category": "Cardiac",
    "difficulty": "Easy",
    "stem": "A patient with hypertension starts amlodipine and later develops ankle swelling and flushing. What best explains this effect?",
    "choices": ["Arteriolar vasodilation from L-type calcium channel blockade in vascular smooth muscle", "Venoconstriction from alpha-1 receptor activation", "Inhibition of angiotensin-converting enzyme", "Blockade of beta-1 receptors in the heart"],
    "answerIndex": 0,
    "explanation": "Dihydropyridine calcium channel blockers (like amlodipine) primarily dilate arterioles, which can cause peripheral edema, flushing, and headache.",
    "reference": ""
  },
  {
    "id": "DCB2-0044",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient is treated with verapamil for rate control and later develops constipation and bradycardia. Which pharmacologic effect best describes verapamil?",
    "choices": ["Blocks L-type calcium channels in the heart, slowing AV nodal conduction", "Blocks fast sodium channels in ventricular myocardium", "Opens potassium channels in vascular smooth muscle", "Inhibits PDE-5 to increase cGMP"],
    "answerIndex": 0,
    "explanation": "Verapamil (a non-dihydropyridine calcium channel blocker) slows AV nodal conduction and can cause bradycardia and constipation. It can worsen HFrEF due to negative inotropy.",
    "reference": ""
  },
  {
    "id": "DCB2-0045",
    "category": "Hematology/Anticoag",
    "difficulty": "Medium",
    "stem": "After coronary stent placement, a patient is placed on an antiplatelet that irreversibly inhibits the ADP (P2Y12) receptor to reduce platelet aggregation. Which medication is this?",
    "choices": ["Clopidogrel", "Aspirin", "Abciximab", "Dipyridamole"],
    "answerIndex": 0,
    "explanation": "Clopidogrel irreversibly blocks the P2Y12 ADP receptor, reducing GPIIb/IIIa activation and platelet aggregation. A known rare complication is thrombotic thrombocytopenic purpura (TTP).",
    "reference": ""
  },
  {
    "id": "DCB2-0046",
    "category": "Hematology/Anticoag",
    "difficulty": "Hard",
    "stem": "During percutaneous coronary intervention, a patient receives an IV medication that prevents platelet aggregation by blocking the GPIIb/IIIa receptor, preventing fibrinogen binding. Which drug was used?",
    "choices": ["Abciximab", "Clopidogrel", "Warfarin", "Heparin"],
    "answerIndex": 0,
    "explanation": "Abciximab is a GPIIb/IIIa inhibitor that blocks fibrinogen binding and platelet aggregation. Major risk is bleeding and thrombocytopenia.",
    "reference": ""
  },
  {
    "id": "DCB2-0047",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient with central diabetes insipidus is treated with a medication that increases water reabsorption via V2 receptors. The same drug can also increase release of von Willebrand factor and factor VIII. Which drug is this?",
    "choices": ["Desmopressin", "Furosemide", "Tolvaptan", "Spironolactone"],
    "answerIndex": 0,
    "explanation": "Desmopressin is a vasopressin analog with V2 selectivity used for central diabetes insipidus, nocturnal enuresis, and mild von Willebrand disease/hemophilia A (via increased vWF and factor VIII release).",
    "reference": ""
  },
  {
    "id": "DCB2-0048",
    "category": "OB/Gyn",
    "difficulty": "Easy",
    "stem": "Which patient is NOT an appropriate candidate for a combined estrogen-progestin oral contraceptive due to increased thrombotic risk?",
    "choices": ["28-year-old nonsmoker with no medical problems", "22-year-old with dysmenorrhea requesting contraception", "38-year-old who smokes 1 pack per day", "30-year-old requesting contraception for cycle regulation"],
    "answerIndex": 2,
    "explanation": "Combined estrogen-progestin contraception increases thrombotic risk. Smoking at age 35 or older substantially increases the risk of cardiovascular and thrombotic events, making combined OCPs inappropriate.",
    "reference": ""
  },
  {
    "id": "DCB2-0049",
    "category": "Dermatology",
    "difficulty": "Medium",
    "stem": "A patient with severe nodulocystic acne is prescribed isotretinoin. Which counseling point is most critical?",
    "choices": ["It is highly teratogenic and requires strict pregnancy prevention", "It commonly causes irreversible ototoxicity", "It must be combined with an MAOI to work", "It routinely causes hemolytic anemia in G6PD deficiency"],
    "answerIndex": 0,
    "explanation": "Isotretinoin is highly teratogenic and requires strict pregnancy prevention measures. It can also cause dry skin/lips, elevated triglycerides, and mood changes in some patients.",
    "reference": ""
  },
  {
    "id": "DCB2-0050",
    "category": "Rheum/Immunology",
    "difficulty": "Hard",
    "stem": "A patient with gout is started on allopurinol and later needs azathioprine for another condition. Why must the azathioprine dose be reduced if combined with allopurinol?",
    "choices": ["Allopurinol inhibits xanthine oxidase, increasing azathioprine/6-MP levels and risk of bone marrow toxicity", "Allopurinol induces CYP3A4, lowering azathioprine levels", "Allopurinol chelates divalent cations, preventing azathioprine absorption", "Allopurinol blocks P-glycoprotein transport, causing immediate hypotension"],
    "answerIndex": 0,
    "explanation": "Allopurinol inhibits xanthine oxidase, which metabolizes 6-mercaptopurine (the active metabolite of azathioprine). Co-administration can increase 6-MP levels and cause severe myelosuppression unless the azathioprine dose is reduced.",
    "reference": ""
 },
  {
    "id": "DCB25-0001",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A 60-year-old with HFrEF is switching from lisinopril to sacubitril/valsartan due to persistent symptoms. What is the most important step to reduce the risk of angioedema during this transition?",
    "choices": [
      "Start sacubitril/valsartan the next day after the last lisinopril dose",
      "Wait at least 36 hours after stopping lisinopril before starting sacubitril/valsartan",
      "Continue lisinopril at a low dose while titrating sacubitril/valsartan upward",
      "Add spironolactone for one week before starting sacubitril/valsartan"
    ],
    "answerIndex": 1,
    "explanation": "ARNI therapy (sacubitril/valsartan) increases bradykinin via neprilysin inhibition. Combining with an ACE inhibitor raises angioedema risk, so a washout period (commonly 36 hours) is required when switching from an ACE inhibitor.",
    "reference": ""
  },
  {
    "id": "DCB25-0002",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient started on hydralazine for resistant hypertension returns with arthralgias, fever, and a new malar-type rash. Which adverse effect is most consistent with hydralazine?",
    "choices": [
      "Drug-induced lupus-like syndrome",
      "Pulmonary fibrosis",
      "Hyperkalemia from ENaC blockade",
      "Optic neuritis with red-green color blindness"
    ],
    "answerIndex": 0,
    "explanation": "Hydralazine can cause a drug-induced lupus-like syndrome (e.g., arthralgias, fever, rash) and is more common in slow acetylators. It may also cause reflex tachycardia and fluid retention.",
    "reference": ""
  },
  {
    "id": "DCB25-0003",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient with hypertension stops clonidine abruptly and develops severe headache, tachycardia, and markedly elevated blood pressure. What best explains this reaction?",
    "choices": [
      "Rebound sympathetic outflow after sudden withdrawal of an alpha-2 agonist",
      "Unopposed alpha stimulation due to beta blocker overdose",
      "Excess acetylcholine due to acetylcholinesterase inhibition",
      "Direct renin inhibition causing acute catecholamine release"
    ],
    "answerIndex": 0,
    "explanation": "Clonidine is a central alpha-2 agonist that decreases sympathetic outflow. Abrupt discontinuation can cause rebound hypertension due to sudden sympathetic activation.",
    "reference": ""
  },
  {
    "id": "DCB25-0004",
    "category": "Cardiac",
    "difficulty": "Easy",
    "stem": "A 68-year-old started on prazosin for hypertension reports dizziness and fainting after the first dose. Which adverse effect is most characteristic of this medication?",
    "choices": [
      "First-dose orthostatic hypotension/syncope",
      "Hyperkalemia",
      "Cough from bradykinin accumulation",
      "Pulmonary fibrosis"
    ],
    "answerIndex": 0,
    "explanation": "Alpha-1 blockers (e.g., prazosin) can cause marked first-dose orthostatic hypotension and syncope. They can also cause dizziness and reflex tachycardia.",
    "reference": ""
  },
  {
    "id": "DCB25-0005",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient with atrial arrhythmia is started on procainamide and later develops arthralgias and a positive ANA. Which adverse effect is most associated with procainamide?",
    "choices": [
      "Drug-induced lupus-like syndrome",
      "Severe constipation and bradycardia",
      "Pulmonary toxicity with fibrosis",
      "Bone marrow suppression with neutropenia"
    ],
    "answerIndex": 0,
    "explanation": "Procainamide (Class IA antiarrhythmic) is associated with drug-induced lupus-like syndrome. Other class IA effects include QT prolongation and torsades risk.",
    "reference": ""
  },
  {
    "id": "DCB25-0006",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A patient is started on sotalol for atrial fibrillation and later develops syncope. ECG shows a prolonged QT interval with polymorphic ventricular tachycardia. Which mechanism best explains this adverse effect?",
    "choices": [
      "Blockade of fast sodium channels causing QRS widening",
      "Blockade of potassium channels prolonging repolarization (torsades risk)",
      "Excess vagal stimulation causing AV nodal blockade",
      "Inhibition of adenosine breakdown causing bronchospasm"
    ],
    "answerIndex": 1,
    "explanation": "Sotalol has Class III activity (potassium channel blockade) that prolongs the QT interval and increases the risk of torsades de pointes. It also has beta-blocking activity.",
    "reference": ""
  },
  {
    "id": "DCB25-0007",
    "category": "Cardiac",
    "difficulty": "Medium",
    "stem": "A 29-year-old with paroxysmal supraventricular tachycardia (PSVT) receives adenosine in the ED and briefly feels chest tightness and flushing. Which additional adverse effect is most concerning in a patient with asthma?",
    "choices": [
      "Bronchospasm",
      "Hyperkalemia",
      "Thrombocytopenia",
      "Nephrolithiasis"
    ],
    "answerIndex": 0,
    "explanation": "Adenosine can cause flushing, chest discomfort, and bronchospasm. It should be used cautiously in patients with reactive airway disease.",
    "reference": ""
  },
  {
    "id": "DCB25-0008",
    "category": "Lipids",
    "difficulty": "Medium",
    "stem": "A patient with familial hypercholesterolemia is started on a PCSK9 inhibitor. How do PCSK9 inhibitors lower LDL cholesterol?",
    "choices": [
      "Increase LDL receptor recycling and increase hepatic LDL clearance",
      "Block intestinal cholesterol absorption via NPC1L1",
      "Inhibit HMG-CoA reductase to reduce cholesterol synthesis",
      "Activate PPAR-alpha to reduce triglycerides"
    ],
    "answerIndex": 0,
    "explanation": "PCSK9 promotes LDL receptor degradation. Inhibiting PCSK9 increases LDL receptor recycling and hepatic clearance of LDL, lowering LDL cholesterol.",
    "reference": ""
  },
  {
    "id": "DCB25-0009",
    "category": "Lipids",
    "difficulty": "Easy",
    "stem": "A lipid-lowering medication blocks intestinal cholesterol absorption by inhibiting the NPC1L1 transporter at the brush border. Which drug is this?",
    "choices": [
      "Ezetimibe",
      "Atorvastatin",
      "Gemfibrozil",
      "Niacin"
    ],
    "answerIndex": 0,
    "explanation": "Ezetimibe inhibits NPC1L1, decreasing intestinal cholesterol absorption and lowering LDL.",
    "reference": ""
  },
  {
    "id": "DCB25-0010",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "An antibiotic binds the 30S ribosomal subunit and causes misreading of mRNA. It is bactericidal and shows synergistic killing with beta-lactams. Which class fits best?",
    "choices": [
      "Aminoglycosides",
      "Macrolides",
      "Tetracyclines",
      "Sulfonamides"
    ],
    "answerIndex": 0,
    "explanation": "Aminoglycosides bind the 30S subunit, cause misreading of mRNA, are bactericidal, and can be synergistic with beta-lactams. Key toxicities include nephrotoxicity and ototoxicity.",
    "reference": ""
  },
  {
    "id": "DCB25-0011",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient treated with gentamicin develops rising creatinine and hearing loss. Which adverse effect profile is most characteristic of aminoglycosides?",
    "choices": [
      "Ototoxicity and nephrotoxicity",
      "Optic neuritis and red-green color blindness",
      "Pulmonary fibrosis and skin hyperpigmentation",
      "Hemorrhagic cystitis and SIADH"
    ],
    "answerIndex": 0,
    "explanation": "Aminoglycosides commonly cause nephrotoxicity and ototoxicity (vestibular or auditory). Risk increases with higher doses and prolonged therapy.",
    "reference": ""
  },
  {
    "id": "DCB25-0012",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A neonate treated with an antibiotic develops vomiting, abdominal distension, cyanosis, and a 'gray' appearance. The neonate has poor hepatic glucuronidation. Which antibiotic is most likely responsible?",
    "choices": [
      "Chloramphenicol",
      "Ceftriaxone",
      "Acyclovir",
      "Vancomycin"
    ],
    "answerIndex": 0,
    "explanation": "Chloramphenicol can cause 'gray baby syndrome' in neonates due to inadequate UDP-glucuronyl transferase activity, leading to drug accumulation and toxicity.",
    "reference": ""
  },
  {
    "id": "DCB25-0013",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient being treated for tuberculosis develops decreased visual acuity and difficulty distinguishing red from green. Which medication is most likely responsible?",
    "choices": [
      "Ethambutol",
      "Isoniazid",
      "Rifampin",
      "Pyrazinamide"
    ],
    "answerIndex": 0,
    "explanation": "Ethambutol can cause optic neuritis with decreased visual acuity and red-green color blindness. Vision monitoring is important.",
    "reference": ""
  },
  {
    "id": "DCB25-0014",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient on therapy for tuberculosis develops hyperuricemia and painful swelling of the big toe. Which medication is most associated with this adverse effect?",
    "choices": [
      "Pyrazinamide",
      "Ethambutol",
      "Rifampin",
      "Isoniazid"
    ],
    "answerIndex": 0,
    "explanation": "Pyrazinamide can cause hyperuricemia (gout flares) and hepatotoxicity. Monitoring is recommended during therapy.",
    "reference": ""
  },
  {
    "id": "DCB25-0015",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A patient with a history of severe IgE-mediated penicillin allergy needs coverage for gram-negative rods including Pseudomonas. Which beta-lactam is least likely to cross-react and is appropriate from the list?",
    "choices": [
      "Aztreonam",
      "Amoxicillin",
      "Piperacillin",
      "Nafcillin"
    ],
    "answerIndex": 0,
    "explanation": "Aztreonam is a monobactam with minimal cross-reactivity to penicillins and covers many gram-negative organisms including Pseudomonas.",
    "reference": ""
  },
  {
    "id": "DCB25-0016",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A hospitalized patient with severe polymicrobial infection receives imipenem and later has a seizure. Which statement best explains this risk?",
    "choices": [
      "Carbapenems can lower the seizure threshold, particularly imipenem",
      "Carbapenems cause severe QT prolongation via potassium channel blockade",
      "Carbapenems are inactivated by pulmonary surfactant",
      "Carbapenems cause hemolysis in G6PD deficiency"
    ],
    "answerIndex": 0,
    "explanation": "Imipenem (a carbapenem) is associated with seizure risk, especially in patients with renal impairment or CNS disease. Carbapenems are broad-spectrum beta-lactams.",
    "reference": ""
  },
  {
    "id": "DCB25-0017",
    "category": "Antibiotics",
    "difficulty": "Easy",
    "stem": "A medication for acne chelates divalent cations and can cause photosensitivity. It is contraindicated in pregnancy and in young children due to effects on teeth and bone. Which drug fits best?",
    "choices": [
      "Doxycycline",
      "Azithromycin",
      "Cefazolin",
      "Linezolid"
    ],
    "answerIndex": 0,
    "explanation": "Tetracyclines (e.g., doxycycline) chelate calcium/iron, can cause photosensitivity, and can discolor teeth and affect bone growth—so they are avoided in pregnancy and in young children.",
    "reference": ""
  },
  {
    "id": "DCB25-0018",
    "category": "Antibiotics",
    "difficulty": "Medium",
    "stem": "A patient on antibiotics develops easy bruising and bleeding. Labs show prolonged PT with normal aPTT. Which cephalosporin side effect best explains this finding?",
    "choices": [
      "Hypoprothrombinemia from impaired vitamin K–dependent factor activation",
      "Platelet GPIIb/IIIa inhibition",
      "Direct thrombin inhibition",
      "Factor Xa activation"
    ],
    "answerIndex": 0,
    "explanation": "Some cephalosporins (especially those with an N-methylthiotetrazole side chain) can cause hypoprothrombinemia and bleeding by interfering with vitamin K–dependent clotting factors.",
    "reference": ""
  },
  {
    "id": "DCB25-0019",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient treated for invasive aspergillosis with voriconazole reports seeing flashes of light and vivid visual disturbances shortly after dosing. Which adverse effect is most characteristic of voriconazole?",
    "choices": [
      "Transient visual disturbances",
      "Severe ototoxicity",
      "Hemorrhagic cystitis",
      "Optic neuritis with red-green color blindness"
    ],
    "answerIndex": 0,
    "explanation": "Voriconazole (an azole) can cause transient visual disturbances (photopsias) and can inhibit CYP enzymes, increasing drug interaction risk. Hepatotoxicity is also possible.",
    "reference": ""
  },
  {
    "id": "DCB25-0020",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient receiving amphotericin B develops fever, chills, and rigors during the infusion. Which description best explains this reaction?",
    "choices": [
      "Infusion-related cytokine reaction that can be managed with premedication/supportive care",
      "IgE-mediated anaphylaxis requiring permanent avoidance",
      "Serotonin syndrome due to MAOI activity",
      "Acute dystonia due to dopamine blockade"
    ],
    "answerIndex": 0,
    "explanation": "Amphotericin B can cause infusion-related reactions (fever, chills, rigors) and nephrotoxicity. Infusion reactions are often managed with premedication (e.g., acetaminophen) and supportive care.",
    "reference": ""
  },
  {
    "id": "DCB25-0021",
    "category": "Antifungals",
    "difficulty": "Medium",
    "stem": "A patient with tinea corporis is prescribed griseofulvin. Which counseling point is most accurate?",
    "choices": [
      "It induces hepatic CYP enzymes and can reduce oral contraceptive efficacy",
      "It is inactivated by pulmonary surfactant and should not be used for pneumonia",
      "It is a PCSK9 inhibitor that lowers LDL",
      "It irreversibly blocks the H+/K+ ATPase in parietal cells"
    ],
    "answerIndex": 0,
    "explanation": "Griseofulvin is used for dermatophyte infections, induces CYP enzymes (reducing efficacy of drugs like oral contraceptives), and can cause photosensitivity. It is generally avoided in pregnancy.",
    "reference": ""
  },
  {
    "id": "DCB25-0022",
    "category": "Antivirals",
    "difficulty": "Medium",
    "stem": "A patient is started on abacavir as part of HIV therapy and develops fever, rash, malaise, and GI symptoms within days. Which genetic test is recommended before starting abacavir to reduce risk of this reaction?",
    "choices": [
      "HLA-B*57:01 screening",
      "Factor V Leiden testing",
      "TPMT activity testing",
      "BRCA1/2 testing"
    ],
    "answerIndex": 0,
    "explanation": "Abacavir can cause a potentially life-threatening hypersensitivity reaction associated with HLA-B*57:01. Screening before initiation reduces risk.",
    "reference": ""
  },
  {
    "id": "DCB25-0023",
    "category": "Antivirals",
    "difficulty": "Medium",
    "stem": "A patient on tenofovir develops proximal tubular dysfunction with phosphate wasting and decreased bone mineral density. Which adverse effect best describes this complication?",
    "choices": [
      "Fanconi-like syndrome with renal tubular toxicity",
      "Pulmonary fibrosis",
      "Optic neuritis",
      "Hemorrhagic cystitis"
    ],
    "answerIndex": 0,
    "explanation": "Tenofovir can cause renal tubular toxicity (Fanconi-like syndrome) and reduced bone mineral density. Monitoring renal function is important.",
    "reference": ""
  },
  {
    "id": "DCB25-0024",
    "category": "Endocrine",
    "difficulty": "Hard",
    "stem": "A patient with thyroid storm is treated with a thionamide followed by iodine solution. Why is iodine given after the thionamide rather than before?",
    "choices": [
      "To prevent iodine from being used as substrate for new thyroid hormone synthesis",
      "To increase thyroid hormone release immediately",
      "To increase peripheral conversion of T4 to T3",
      "To prevent hyperkalemia by blocking ENaC"
    ],
    "answerIndex": 0,
    "explanation": "Iodine acutely inhibits thyroid hormone release (Wolff-Chaikoff effect), but if given before thionamides it can also provide substrate for new hormone synthesis. Giving a thionamide first blocks synthesis, then iodine blocks release.",
    "reference": ""
  },
  {
    "id": "DCB25-0025",
    "category": "Endocrine",
    "difficulty": "Medium",
    "stem": "A patient on long-term high-dose prednisone develops proximal muscle weakness, easy bruising, and osteoporosis. Which complication is most directly related to glucocorticoids and requires preventive management?",
    "choices": [
      "Osteoporosis and fracture risk",
      "Optic neuritis",
      "Hemorrhagic cystitis",
      "Gray baby syndrome"
    ],
    "answerIndex": 0,
    "explanation": "Chronic glucocorticoid therapy increases osteoporosis risk (bone loss and fractures). Preventive measures often include calcium/vitamin D and, in higher-risk patients, bisphosphonates based on clinical assessment.",
    "reference": ""
  }
]

